 // this functions toggles the upload button to be disabled and enabled 



 //starts here ---------------------------_>



function toggleButton(InputID, ButtonID){

    if($('#'+InputID).val() ==""){
      $('#'+ButtonID).prop('disabled',true);
      }
      else {
        $('#'+ButtonID).prop('disabled',false);
      }

}

  //ends here <-------------------------------------
 

//   ===================================================================================


// this is for the progress bar of the file upload process

//starts here ---------------------------_>


  maProgressBar = $('#progressbar');


  $('.allUploadForms').ajaxForm({
  
  beforeSend: function() {
  
  var percentVal = '0%';
  maProgressBar.width(percentVal);
  maProgressBar.html(percentVal);
  },

  uploadProgress: function(event, position, total, percentComplete) {
  window.location.hash = '#';
  var percentVal = percentComplete + '%';
  maProgressBar.width(percentVal)
  maProgressBar.html(percentVal);
  },

  success: function(response){
    $("#upload_msg").text(response.msg);
    $("#upload_msg").fadeIn('fast').delay(1000).fadeOut('fast');
    maProgressBar.width(0)
    maProgressBar.html('0%');
  },

  error: function(response){
    $("#upload_msg").text(response.error);
    $("#upload_msg").fadeIn('fast').delay(1000).fadeOut('fast');
    maProgressBar.width(0)
    maProgressBar.html('0%');
  },

  

  });

  //ends here <-------------------------------------





//   ===================================================================================


  // this is for the delete Modal popup

//starts here ---------------------------_>
 
            function getDeleteModal(elementID,msg){
            $("#exampleModalLabel").html(msg);
            var hr = $("#"+elementID).attr("href");

           $("#modalAnchor").attr('href',hr);
          
          
            }

//ends here <-------------------------------------





  //cascading dropdwon 

  var GovernorateObject = {
    "بيروت": {
      "بيروت": ["الاشرفية", "الرميل", "المدور", "المرفأ", "الباشورة", "الصيفي", "رأس بيروت", "المصيطبة" 
      ,"المزرعة", "زقاق البلاط", "ميناء الحصن", "عين المريسة"]
   
    },

    "جبل لبنان": {
      "بعبدا": ["بعبدا", "الحدث", "فرن الشباك", "برج البراجنة", "ليلكي", "حارة حريك", "شياح", "تحويطة الغدير" 
      ,"كفرشيما", "المرداشي", "بطشاي", "وادي شحرور السفلى", "وادي شحرور العليا", "حارة الست", "لويزة"
      ,"عاريا", "شويت", "العباديه", "الهلاليه", "رويسة البلوط", "بعلشميه", "حارة حمزة"
      ,"رأس الحرف", "قتاله", "القريه", "بسابا", "قرطاضة", "زندوقه", "القصيبه"
      ,"الكنيسه", "رأس المتن", "العربانيه", "عين حمادة"
      ,"الكنيسه", "صليما", "حاصبيا المتن", "بزبدين"
      ,"ارصون", "جورة ارصون", "قرنايل", "دير خونا "
      ,"الشميسة", "دير الحرف", "بتبيات", "بمريم"
      ,"بتخنيه", "القلعه", "الخلوات", "فالوغا"
      ,"حمانا", "شبانية", "عين موفق", "مزرعة المزيرعة"
      ,"الخريبة", "كفرسلوان", "جوار الجوز", "ترشيش"
     ,"وادي الدلاب","عين الرمانة","الغبيري"]

     ,

     "المتن": [ "برج حمود", "بوشرية", "دكوانة", "سن الفيل", "الجديدة", "وطى عمارة شلهوب", "الزلقا" 
     ,"جل الديب", "انطلياس", "النقاش", "ضبيه", "وقفية ابي اللمع", "الديشونية", "المنصورية"
     ,"مكلس", "مار روكز و ضهرالحصين", "فنار", "بياقوت", "بقنايا", "المجذوب", "مزهر"
     ,"بصاليم", "المطيلب", "الحضيرة", "مزرعة دير عوكر", "حارة البلان", "مزرعة بيت شعار", "دير طافيش"
     ,"ديك المحدي", "مار عبدا المشمر", "زكريت", "قرنة الحمرا", "مزرعة ياشوع", "حبوس", "بيت الككو"
     ,"عين عار", "قرنة شهوان", "نابية", "قنابة برمانا", "جورة البلوط", "رومية", "برمانا"
     ,"عين سعادة", "بيت مري", "المسقى و الغابة", "مار شعيا و المزكة", "العيون", "بعبدات و السفيلة", "العطشانة"
     ,"عين علق", "الشاوية والقنيطرة", "الفريكة", "بيت شباب", "مار بطرس  كرم التين", "ساقية المسك و بحرصاف", "ضهر الصوان"
     ,"بكفيا", "وادي شاهين", "المياسة", "حملايا", "عين الخروبة", "شويا", "المحيدثة"
     ,"عين القش", "زغرين", "العيرون", "الدوار", "زرعون", "القنابة", "بسفرين الزاهرية"
     ,"القعقور", "مار مخايل بنابيل", "عين الزيتونة", "المروج", "وطى المروج", "عين السنديانة", "ضهور الشوير"
     ,"الخنشارة", "الجوار", "عين التفاحة", "ابو ميزان", "شرين", "مار موسى الدوار", "عين الصفصاف"
     ,"بسكنتا", "عين القبو", "كفر عقاب", "المتين", "كفرتيه", "عينطورة", "مجدل ترشيش"
     ,"بتغرين", "المشرع", "وادي الكرم", "السفيلة", "مشيخا", "زبوغا", "مرجبا"
     ,"زوق الخراب", "دير شمرا", "الخلة", "بشلاما", "قرنة شهوان - رابية", "انطلياس - رابية", "مطيلب - رابية"
     ,"نقاش - رابية", "وقف دير مار جرجس", "مار يوسف البرج", "الشميس", "قنابة صليما"
    ]

    ,

    
    "الشوف" :  ["الناعمة","الدامور","الرميلة","الجية","برجا","سبلين","جدرا","بعاصير","ضهر المغارة","دبية"
    ,"البرجين (غير ممسوحة)","عين الاسد والشميس","شحيم","المعنية","دلهون","الوردانية","كترمايا"
    ,"دلهمية (غير ممسوحة)","شمارين (غير ممسوحة)","دير القمر","بيت الدين","بعقلين","السمقانية","المشرف"
    ,"داريا (غير ممسوحة)","كفر قطرا (غير ممسوحة)","الكنيسة (غير ممسوحة)","معاصر بيت الدين","دوير بصنيه (غير ممسوحة)","عميق (غير ممسوحة)"
    ,"كفر حمل (غير ممسوحة)","دير كوشة (غير ممسوحة)","بشتفين (غير ممسوحة)","كفر فاقود (غير ممسوحة)","دير بابا (غير ممسوحة)"
    ,"دميت (غير ممسوحة)","المغيرة (غير ممسوحة)","البقايا (غير ممسوحة)","سرجبال","كفرحيم","غابة جعفر (غير ممسوحة)"
    ,"وادي الدير","دير دوريت","وادي بنحلة (غير ممسوحة)","بنواتي (غير ممسوحة)","الجاهلية (غير ممسوحة)","عنبال","عترين"
    ,"الكحلونية (غير ممسوحة)","عين قني","المختارة","بطمه","الجديدة (غير ممسوحة)","عين وزين","بتلون (غير ممسوحة)"
    ,"كفر نبرخ (غير ممسوحة)","الفوارة","بريح و مطيلة (غير ممسوحة)","وادي الست (غير ممسوحة)","مجدل المعوش"
    ,"شوريت (غير ممسوحة)","الجدايل و كفرحي (غير ممسوحة)","البيرة (غير ممسوحة)","كفرنيس (غير ممسوحة)"
    ,"الورهانية (غير ممسوحة)","عين زحلتا (غير ممسوحة)","الفريديس","الباروك (غير ممسوحة)"
    ,"معاصر الشوف (غير ممسوحة)","الخريبة (غير ممسوحة)","بعدران (غير ممسوحة)","حارة جندل (غير ممسوحة)"
    ,"مزرعة الشوف (غير ممسوحة)","غريفة","حصروت","عانوت","مزبود","المغيرية (غير ممسوحة)","مجدلونة"
    ,"جميلية","علمان (غير ممسوحة)","جون (غير ممسوحة)","دير المخلص (غير ممسوحة)","قرية (غير ممسوحة)"
    ,"مزمورة(غير ممسوحة)","بكيفا (غير ممسوحة)","خربة بسري (غير ممسوحة)","مزرعة الضهر (غير ممسوحة)","الجليلية"
    ,"الزعرورية","مطلة و بزينا (غير ممسوحة)","بسابا (غير ممسوحة)","بيقون (غير ممسوحة)","عماطور"
    ,"باتر (غير ممسوحة)","جباع (غير ممسوحة)","مرستي (غير ممسوحة)","الكليلية","عين الحور (غير ممسوحة)"
    ,"حارة بعاصير (غير ممسوحة)","نيحا (غير ممسوحة)","بقعاتا (غير ممسوحة)","مار بعبدا","الصفا","القريعة"
                     
  ]

  ,

  "عاليه" : [
    
    "العمروسية","القبة","الامراء"
  ,"عاليه","بشامون","دير قوبل","عين عنوب","شملان","عيتات","بليبل","حومال","بدادون","بمكين","سوق الغرب","القماطية","عين الرمانة",
  "بسوس","الكحالة","عين الجديدة","بحمدون القرية","عين صوفر","بحمدون المحطة","شانيه","مجدل بعنا","عين دارة (في المساحة)"
  ,"بتاتر (في المساحة)","بطلون","عرمون","معصيرتي (غير ممسوحة)","بسرين (غير ممسوحة)","عين الحلزون (غير ممسوحة)",
  "حبرمون (غير ممسوحة)","مزرعة النهر (غير ممسوحة)","الرملية","المريجات (غير ممسوحة)","بدغان","شارون","أغميد (غير ممسوحة)",
  "العزونية (غير ممسوحة)","مشختي (غير موجودة)","بمهرية (غير ممسوحة)","المنصورية وعين المرج","عين درافيل (غير ممسوحة)",
  "بعورتة","دقون","كفرمتى","عبيه","عين كسور","البساتين","عيناب","دفون","رمحالة","البنية (غير ممسوحة)"
  ,"سلفايا (غير ممسوحة)","بو زريدة (غير ممسوحة)","مجدليا (غير ممسوحة)","دوير الرمان (غير ممسوحة)",
  "شرتون","عين تراز (غير ممسوحة)","رويسات النعمان","رشميا","المشرفة (غير ممسوحة)","كفر عميه","بخشتيه"
  ,"الغابون","بحوارة","حمص و حماه (غير ممسوحة)","كيفون","بيصور","التعزانية","الرجمة","سرحمول","عين جويق"
  ,"القلعة","مضوايا","المشرفة","المعيصرة","وطى شارون","الشرقية","وادي بدغان","دير سير وعديسة سير"
  ,"عين الفريدس","عين الجوزة","جسر القاضي","عين السيدة","مزرعة حمود","حارة سالم","صوفر","مشقيته" 

]
,

"كسروان" : [
    
  "ذوق مصبح","ذوق مكايل","صربا","غادير","حارة صخر","ساحل علما","غزير","ادما والدفنة","كفر ياسين","وطى سلام",
  "طبرجا","الصفرا","البوار","العقيبة","بقاق الدين","عينطورة","عين الريحانة"
  ,"جعيتا","السهيلة الفوقا","بلونة","عجلتون","داريا","القليعات","ريفون","عشقوت","فيطرون","درعون","غوسطا","بزمار","حاريصا"
  ,"بطحا","مزرعة الرأس","مزرعة مراح المير","خرائب نهر ابراهيم","المعيصرة","زيتون","نمورة و كفر شريف","فتقا","شننعير","معراب",
  "دلبتا","عرمون","جديدة غزير","الكفور","غدراس","العذرا","الزعيترة","بزحل","المرادية","جورة بدران","غبالة","الحصين","جورة ترمس",
  "الغينة","هرهريا و القطين","حياطة","شحتول","جورة مهاد","مزرعة كفرذبيان","ميروبا","فاريا","حراجل","وطى الجوز","رعشين","إغبة"
  ,"بقعاتة عشقوت","دير بقلوش","بقعاتة كنعان","بقعتوتة","كفرتيه","يحشوش","نهر الدهب","عين الدلبة","مغاير","العبرة والشوان"
]
,

"جبيل" : [
    
  "الجليسة","سبرين","بشللي","زبدين","فتري وبيرالهيت",
  "ادونيس وسنور","الحصون","جورة القطين","رأس اسطا","كفر قواص","بشتليدا","مشان","عين جرين","عبن الدلبة","نهر ابراهيم","حالات","مستيتا"
  ,"قرطبون","جبيل","عمشيت","الريحاني","المنصف","البرباره","كفركده","الفغال","بزيون","فرجت","افقا (غير ممسوحة)","اهمج","الصوان","فراط",
  "قرقريا (غير ممسوحة)","بلحص","قرطبا (غير ممسوحة)","جنه","لاسا?(غير ممسوحة)","عين الغويبة (غير ممسوحة)","سرعيتا","غابات (غير ممسوحة)","يانوح",
  "مزرعة السياد","المغيرة","بلاط","بمهرين","اده","غرفين","حصرايل","جدايل","شيخان","غرزوز","بخعاز","شموت","معاد","القطارة (غير ممسوحة)"
  ,"كفر بعال (عنايا)","ترزيا","المجدل (غير ممسوحة)","حبوب","بريج","حصارات الرشقيف","حبالين","كفر ماشونة ودملصا (غير ممسوحة)",
  "بنتاعل (فدار السفلى)","بحديدات","بركة حجولا (غير ممسوحة)","قهمز","بجة","لحفد","جاج","عين كفاع","الراموت","غلبون","الكفر و الحرف"
  ,"ساقية الخيط","هابيل","حاقل","بيت حباق","كفون","شامات","العاقورة (غير ممسوحة)","ميفوق (غير ممسوحة)","علمات الشمالية",
  "علمات الجنوبية (غير ممسوحة)","اللقلوق","الخاربة","سقي رشميا","مشمش (غير ممسوحة)","ترتج","حجولا (غير ممسوحة)","مار سركيس",
  "هدينة","تدمر وسرغل (غير ممسوحة)","عرب اللهيب (غير ممسوحة)","المغيري (تحديد اختياري)","وطى الحراجلية","عبيدات"
  ,"كفر مسحون","عنايا","عين قونا (غير ممسوحة)","عاليتا","عرسنا (غير ممسوحة)","المنيطره","مزرعة عبود","المزاريب"
]

},

"الشمال": {

  "طرابلس" : [
    
    "الحدادين","التل","النوري","المهاترة","الزاهرية","الرمانة","السويقة والجسرين","التبانة"
    ,"القبة","الحديد","الميناء 11","الميناء 12","الميناء 13","بساتين الميناء","بساتين طرابلس","زيتون طرابلس","البداوي","دير عمار"
    ,"برج اليهودية","المنية","زوق بحنين","الريحانية","كفر حبو","القلمون","البقيعة","تربل","مركبتا","عزقى","كفر شلان","مراح السريج"
    ,"دير نبوح","الواطية وحرف الصياد","الخرنوب","بخعون","حقل العزيمه","عاصون","القطين","سير","بقاع صفرين (غير ممسوحة)"
    ,"بقرصونة (غير ممسوحة)","بحديتا","طاران","بيت الفقس","النبي يوشع","حواره (غير ممسوحة)","ايزال (غير ممسوحة)"
    ,"الاسكلة (غير ممسوحة)","كهف المللول (غير ممسوحة)","عمار (غير ممسوحة)","مزرعة القرين","مراح السفيرة","الحازمية","عين التينة"
    ,"زغر تغرين","السفيرة","قرصيتا (غير ممسوحة)","نمرين وبكورة (غير ممسوحة)","مربين (غير ممسوحة)","بتحلين","بشحارة","جرجور"
    ,"مزرعة الكرام","بطرماز","بيت زاعود (غير ممسوحة)","بشناتا (غير ممسوحة)","قرحيا","الروضة","كرم المهر","كفر بنين","بيت حاويك"
    ,"القمامين","عصيموت","شالوط","الكرين","بيت زود","بيت حسنا","بيت السن","بيت الضاضون","بيت داود","بتليا","قزحيا ودبعل"
    ,"السواقي","مزرعة كتران","عين الصفصافه","داريا","فوار الصليب","مزرعة ارطوسه","الكنيسة","وادي النحلة","كتران"
  ]

  ,

  "الكورة" : [
    
    "رأس مسقا الشمالية و الجنوبية",
    "بكفتين","ددة","بترومين","برسا","النخلة","بتوارتيج","كفر قاهل","بصرما","عابا","بدبا","فيع","قلحات","بلمند (غير ممسوحة)"
    ,"عفصضيق","بطرام","كفر عقا","كوسبا","كفر صارون","اميون","بزيزا","بشمزين","كفر حزير","بدبهون","برغون","زكرون"
    ,"الحريشه","انفه","دار شمزين","دار بعشتار","بحبوش","عين عكرين","رشدبين","بنهران","المجدل","كفتون"
    ,"اجد عبرين","بتعبورة","كفرحاتا","بدنايل","كفريا","دير بلا","طورزا","زغرتا المتاولة","متريت"
  ]

  ,


  "زغرتا" : [
    
    "عردات","مجدليا","علما","زغرتا","كفردلاقوس","ارده","مرياطة","عشاش","دنهي"
    ,"رشعين","كره باش","اصنون","مزرعة اجبع","التلت","كفر حورا","كفرزبنا","الجديدة","مزرعة جنيدة","كفرحاتا","الحريق","الخالدية",
    "لعل (غير ممسوحة)","مرح كفرسغاب","كفر ياشيت","بسبعل","كفر شختا","بشنين","بنعشي","عرجس","داريا","راسكيفا","كفرفو","كرم سده",
    "سبعل","مزيارة","مزرعة التفاح","اجبع","ايطو","سرعل","عربة قزحيا وتوابعها","عينطورين","اهدن","بسلوقيط","تولا"
    ,"الروضة (غير ممسوحة)","بحيرة تولا","كفر صغاب","صخرة","حيلان","بوسيط","مزرعة حريقص","مزرعة كفريا","ايعال"
  ]

  ,


  "البترون" : [
    
    "شكا","هري","حامات","وجه الحجر","سلعاتا","كبا","البترون","تحوم","عبرين","كفر عبيدا"
    ,"راشانا","بسبينا","كفيفان","اجدبرا","بجدرفل","دير كفيفان","راس نحاش","اده","كفر خلص","مزرعة قرنعون","كور","تنورين الفوقا",
    "كفر حي","صورات","دير مار يوسف جربتا","سمار جبيل","راشكده","جران","مراح شديد","دريا","عرطز","مراح الزيات","شوما","حلتا","جربتا"
    ,"بقسميا","كفر حتنا","عبدللى","حربونا","صغار و وطى صغرتا","جيلا","شبطين","زان","آصيا","داعل","تولا","الفتاحات","كفر شليمان"
    ,"دوما","بشتودار - عوره","حدتون","كفر حلده","محمرش","بيت شلالا","مار ماما","العلالي","نيحا","كفور العربي","بشعله","راشا","الدوق"
    ,"مسرح","ضهر ابي ياغي","رام","مراح الحاج","تنورين التحتا","وطى حوب","شاتين","حردين","بيت كساب","دير مار يوحنا دوما","نحلا",
    "دير بللا","هربونا","حنوش - حامات","غوما","قرنعون","ترحمانا","الكراسي","البقيعة","شويت التحتا","شويت الفوقا","مزرعة التنوري",
    "شمس","النخلة","قرنة المراح","دير مار يعقوب الحصن","ضهر المكمن","خراج كفرحتنا","مزرعة قندولي","بستان العصي","راشكيدا"
  ]

  ,

  "بشري" : [
    
    "بشري","بان","بلوزا","حدشيت","بقاع كفره (غير ممسوحة)"
    ,"بقركاشا يوجد نواقص","بزعون","الديمان","بريسات","حدث الجبة","حصرون","الوادي قنيوبين (غير ممسوحة)","مزرعة بني صعب"
    ,"زغرتا المتاولة","برحليون","عبدين","مغر الاحول","قنيور","بيت منذر","بلا","قنات","مزرعة عساف","طورزا"
  ]

    
},


"الجنوب": {

  "صيدا" : [
    
    "الوسطاني","مدينة صيدا","دكرمان","الغازية","حارة صيدا","بقسطة","عبرا"
    ,"البرامية","الهلالية","مجدليون","صالحية","مية ومية","عين الدلب","القرية","درب السيم","النجارية","العدوسية","البيسارية","صرفند",
    "سكسكية","عدلون","اليهودية","مزرعة الواسطة","الجزيرة","مطرية الشومر","ارزي","الخرايب","مزرعة جمجيم","كفربدا","الحارثية","ساري"
    ,"انصارية","دير تقلا","محيدلة","كوثرية الرز","وساميات","بابلية","لوبية","داوودية","خربة الدوير","غسانية","قعقعرية الصنوبر",
    "تبنا","سنيبر","تفاحتا","المروانية","خربة البصل","مصيلح","الحجة","الحسينية","المعمرية","عقتنيت","قناريت","زيتا"
    ,"مغدوشة","مطرية جباع","زغدرايا","طنبوريت","عنقون","كفريا","كفرحتى","بنعفول","خزيز (محروقة)","اركي","كفرملكي","كوثرية السياد",
    "خرطوم","الزرارية","عرب طبايا","عرب سكر","عرب الجل","برتي","سفنتي","كفر شلال","كفر بيت","ينطا (غير ممسوحة)","القنيطرة"
  ]

  ,

  "صور" : [
    
    "عين ابو عبد الله","محيلب","العباسية","برج الشمالي","بازورية","صور","عين بعال","باتولية","دير قانون راس العين"
    ,"قليلة","الحنية","العزية","المنصورى","الشعيتية","الكنيسة","حناوية","رمادية","قانا","عيتيت","وادي جيلو","طير دبة"
    ,"يانوح","معركة","طورا","حناتا","برج رحال","دير قانون النهر","بدياس","الحلوسية","طير فليسة","حميري","معروب","باريش","دبعال"
    ,"جويا","مزرعة مشرف (غير ممسوحة)","محرونة (غير ممسوحة)","مجادل (غير ممسوحة)","الشهابية (غير ممسوحة)","البافليه","بستيات","شحور",
    "مزرعة طير سمحات","ارزون","دردغيا","صريفا","النفاخية","رافد مارنبا","فرون","الطويرى","نيحا (محروقة)","دير كيفا","سلعا (محروقة)"
    ,"البياض","دير عامص","رشكنانية","صديقين (محروقة)","جبال البطم","زبقين","مجدلزون","شمع","اسكندرونة","ججيم","البستان","الجزيرة"
    ,"الناقورة","الجبين","علما الشعب","مروحين","طير حرفا","الظهيرة","شيحين","يارين","ام الرب","ام التوته","ابو شاش","الزلوطية"
  ]

  ,

  "جزين" : [
    
    "طمرة","الدمشقية","الجرمق","المحمودية","جزين","وادي جزين"
    ,"العيشية","بكاسين وتوابعها","كفرحونة","عرمتى","الريحان","بنواتي","مشموشة","صباح","عازور","روم","الحمصية","القبع","قيتولي"
    ,"عاريا","بحنين","زغرين","قروح","خلة خازن","شبيل","الوزيد","الوردية","العرقوب","الميدان (محروقة)","الحرف","تفيد","بسري",
    "بتدين اللقش","الغباطية","سجد","جرنايا","عقناتا","اللويزة","مليخ","صيدون","مزرعة الرهبان","جبل طورا","الرمانة (غير ممسوحة)",
    "زحلتي","حيطورة","سنيه","حيداب","المكنونية","قطين","ريمات","بصليا","أنان","صفاريه","كفر فالوس","مراح الحباس","لبعة","كرخا"
    ,"شواليق","وادي بعنقودين","كفر جرة","بيصور","حيتولي","المجيدل","عين المير","جنسنايا","المحاربية","وادي الليمون","الحسانية",
    "قتالة","مزرعة المطحنة","ضهر الدير","القطراني","عين مجدلين","شقاديف","السويرة","جوار السوس","لوزيد","السريرة"
  ]





},


"البقاع": {

  "زحلة" : [
    
    "معلقة البناء","حوش الامراء (بناء)",
    "مجدل عنجر","مكسة","تعنايل","حوش الغنم","جديتا","سعد نايل","بر الياس","عنجر","عين كفر زبد","تربل","الدلهمية","الفرزل"
    ,"ابلح","حوش حالا","النبي ايلا","علي النهري","حوش الامراء (اراضي)","رعيت","رياق","نيحا","ماسا","المريجات","بوارج","وادي العرايش"
    ,"قاع الريم","حزرتا","التويتي","وادي الدلم","مزرعة الرمتانية","المعلقة و معلقة كرك","حوش الزراعنة","مار جرجس ومخايل"
    ,"الميدان","البربارة","مار الياس","سيدة النجاة","مار انطونيوس","الراسيه","اراضي زحله","معلقة الاراضي","ناصرية رزق"
    ,"تل الاخضر","تشفلق اده","تشفلق قيقانو","ناصرية ثابت","حوش القيصر","مزرعة بمهرين","حوش الصيادة","قب الياس","مندرة"
    ,"شبرقية ثابت","زبدل","شتورا","تعلبايا","كسارة","كفر زبد","تل عمارة","حشمس","قوسايا","دير الغزال","زحلة"
  ]

  ,

  "البقاع الغربي" : [
    
    "المرج","الجزيرة","الصويرة","غزة","سلطان يعقوب","الحمّارة"
    ,"جب جنين","كامد اللوز","خربة قنافار","كفريا","المنصورة","القرعون","الاسطبل","الوقف"
    ,"حليمةالصغرى","حوش الحريمة","خيارة العتيقة","الدكوة","الخيارة","حبوبا","تل زنوب","عانا","دير طحنيش"
    ,"شبرقية عميق","عميق","دير عين الجوزة","زلايا","سحمر","صغبين","عيتنيت","عين التينة","عين زبدة",
    "قليا","باب مارع","بعلول","لبايا","لوسيا","مشغرة","ميدون","لالا","يحمر","جرد عميق"
  ]

  ,

  "راشيا" : [
    
    "راشيا الوادي","مدوخا","مزرعة السلساتا","بكا","بكيفا","بيت لهيا","البيره","تنوره","حلوه","حوش قنعبة","خربة روحا"
    ,"دير العشاير","محيدثة","الرفيد","ضهر الاحمر","عقبه","عيتا الفخار","عيحا","عين حرشا","عين عرب"
    ,"عين عطا","قنعبة و مزرعة جعفر","كفر دنيس","كفر قوق","كفر مشكي","كوكبا","مجدل بلهيص","ينطا"
  ]

  ,


},

"النّبطيّة": {

  "النّبطيّة" : [
    
    "النبطية الفوقا","النبطية التحتا","زفتا","حومين التحتا","عزة","بفروة","انصار","مزرعة بصفور","مزرعة شلبعل","النميرية",
    "مزرعة دمول","قلعة ميس","عبا","جبشيت","كفر دجال","عدشيت","القصيبة","بريقع","صير الغربية","كفر صير","قعقعية الجسر",
    "زوطر الشرقية","زوطر الغربية","ميفدون","شوكين","حاروف","الدوير","تول","الكفور","دير الزهراني","مزرعة البياض","حبوش",
    "عرب صاليم","كفر رمان","زبدين","كفر تبنين","ارنون","الحمرا","يحمر","جباع","عين بوسوار","جرجوع","رومين","حميلة"
    ,"صربا","حومين الفوقا","مزرعة الخريبة","كفر فيلا","عين قانا","الشرقية","مزرعة كفر جوز","علي الطاهر","سيني"
  ]

  ,

  "بنت جبيل" : [
    
    "تبنين (غير ممسوحة)","كفر دونين (غير ممسوحة)","برج قلاويه (غير ممسوحة)","غندورية (غير ممسوحة)","قلاويه (غير ممسوحة)"
    ,"خربة سلم (غير ممسوحة)","دير انطار (غير ممسوحة)","السلطانية (غير ممسوحة)","جميجمه (غير ممسوحة)","صفد البطيخ (غير ممسوحة)"
    ,"برعشيت (غير ممسوحة)","عيتا الزط (غير ممسوحة)","حداثا (محروقة)","حاريص (غير ممسوحة)","كفرة (غير ممسوحة)","ياطر (غير ممسوحة)"
    ,"صربين (غير ممسوحة)","بيت ياحون (غير ممسوحة)","بيت ليف (غير ممسوحة)","رشاف (غير ممسوحة)","الطيري (غير ممسوحة)",
    "كونين (غير ممسوحة)","عيناتا (غير ممسوحة)","صالحاني (غير ممسوحة)","راميه (غير ممسوحة)","قوزح (غير ممسوحة)","دبل (غير ممسوحة)"
    ,"عيتا الشعب (غير ممسوحة)","حانين (غير ممسوحة)","عين ابل (غير ممسوحة)","رميش (غير ممسوحة)","قطمون (غير ممسوحة)"
    ,"يارون (غير ممسوحة)","مارون الراس (غير ممسوحة)","عيترون (غير ممسوحة)","بنت جبيل (غير ممسوحة)","الحسينية (غير ممسوحة)"
    ,"الجامح (غير ممسوحة)","البركة (غير ممسوحة)","الحوارة (غير ممسوحة)","عين الصفيرة (غير ممسوحة)","شقرا","فرون"
  ]

  ,

  "حاصبيا" : [
    
    "كفر حمام (غير ممسوحة)"
    ,"راشيا الفخار (غير ممسوحة)","كفر شوبا (غير ممسوحة)","شبعا (غير ممسوحة)","الهبارية (غير ممسوحة)","الفرديس (غير ممسوحة)"
    ,"الماري (غير ممسوحة)","السلمية (غير ممسوحة)","الكفير","خلوات الكفير","برغز","عين قنيا","شويا","المجيدية"
    ,"عين جرفا","ابو قمحة","خلوات","مزرعة حلتا","الزينية","الدلافة","كوكبا","ميمس","حاصبيا","مرج الزهور","الخريبة","غير معرف"
  ]

  ,

  "مرجعيون" : [
    
    "القليعة","الخربة","الخيام","دير ميماس","هوره (محروقة)","كفركلا (غير ممسوحة)","مزرعة السرده (غير ممسوحة)"
    ,"العمره (غير ممسوحة)","نخيله (غير ممسوحة)","دير ميماس - دمياط","دبين","بلاط","مزرعة الجدين (غير ممسوحة)","ابل السقي"
    ,"اللويزه (غير ممسوحة)","عديسه (غير ممسوحة)","مركبا (غير ممسوحة)","مجدل سلم","قبريخا","العيون (غير ممسوحة)"
    ,"المدارس و الجرين (غير ممسوحة)","السرايا (غير ممسوحة)","العين دلافي (غير ممسوحة)","برغز","المجيديه (محروقة)",
    "الدلافه (غير ممسوحة)","كوكبا (غير ممسوحة)","الفوقاني (غير ممسوحة)","السراي (غير ممسوحة)","صفيفا (غير ممسوحة)","جديدة مرجعيون"
    ,"البيوضة (غير ممسوحة)","تولين (غير ممسوحة)","صوانة (غير ممسوحة)","ميس الجبل (غير ممسوحة)","حاصبيا","رب الثلاثين","بليدا"
    ,"الوزاني","بني حيان","القصير","علمان","محيب","عدشيت القصير","قنطرا","برج الملوك","دير سريان","طلوسا","الطيبة","حولا"
  ]

  ,


},

"عكّار": {

  "عكّار" : [
    
"حكر الظاهري","المحمرة","ببنين","وادي الجاموس","العمارة","قبة شمرا","سمقلة","كفر ملكي","المقيتة (غير ممسوحة)","الرمول","القليعات"
,"شيخ زناد تل بيبي","العريضة","السماقية","الكنيسة","مغراق","تل كرى","الحيصا (غير ممسوحة)","قعبرين","تل سبعل","مارليا ملحم"
,"دير دلوم","مار توما","دحر حدارا","ذوق المقشرين","عرقا","منيارة","الجديدة","سهل الشيخ طابا","حلبا","السمونية","الشيخ محمد",
"الخريبة","تل عباس الغربية","كويخات","تل عباس الشرقية","سعدين","الغزيله","دارين","شير حميرين","العبودية","جورة سرار","تلخميرة",
"تلبيرى","المسعودية","مشتى حمود و مشتى حسن و شدره","الزواريب","شيخ تلة سابا (غير ممسوحة)","دايرة نهر الكبير","بيت الحوش","برقايل"
,"جديدة القطيع","عيون الغزلان","سفينة القطيع","القرقف","مجدلا","حميرة","بقرزلا","مشيلحة عكر (غير ممسوحة)","ذوق الحصنية و ضهر عياص"
,"جبرايل","تكريت","القنطرة","ذوق الحبالصة","عدبل","بيت غطاس","ضهر الليسينه","رحبة","تل الشطاحة","اليون (غير ممسوحة)"
,"كرم عصفور و النهرية","النفيسة","قبولا","ايلات","بينو","بيت ملات","ممنع","قبيات","بزبينا","سيسوق","قلود الباقية","مشحا","حيزوق",
"مشمش (غير ممسوحة)","عكار العتيقة","عيات","عين يعقوب","مزرعة النهرية","القريات","الهد","الشقدوف","البرج","صيدنايا","كفر حرة","شربيلا"
,"السويسة","بيت يونس (ناقص اول 56 عقار)","قته","دير جنين (غير ممسوحة)","كروم عرب","الريحانية","سفينة الدريب","صدقه","بيت ايوب"
,"ضهر الكنيسة (غير ممسوحة)","جانين","عكر قشلق","التليل","عمار البيكات","الهيتلا","عين الزيت","سنديانة زيدان (غير ممسوحة)"
,"الدغله","حوشب","عين تنتا","الدوسه وبغدادي","خربة داوود","خربة شار","المصلا","دوير عدوية","فسيقين و عين اشما","وادي الحور"
,"دنكة و العامرية","كواشرة","نوراالفوقاوالتحتا (غير ممسوحة)","بربارة","العرمة (غير ممسوحة)","المزيحمة","الخرنوبة","كفر الفتوح","برتا"
,"سرار","حميص","وادي خالد (غير ممسوحة)","العيون","الحاكور","المقيطع","عروبة (غير ممسوحة)","حكر الشيخ طابا الجبل","بزال (غير ممسوحة)"
,"عندقت (غير ممسوحة)","القصير","العوينات","القرنة","الدورة","تاشع","فنيدق","الحويش","دينو","حرار","قبعيت","حبشيت","شان"
,"خريبة الجرد","منجز","اكروم - كفرتون","اكروم - المونة","المجدل","الدبابية","الرماح","مشتى حسن","عيدمون","البيرة","الباردة",
"العوينات","الخالصة","فريدس","كفرنون","كرم شباط","شدرا","خربة رمان","حميص","الرويمة","اكروم - قبعة حسين","النهرية و بستان الحرش"
  ]

},


"بعلبك الهرمل": {

  "بعلبك" : [
    
    "دورس","بيت شاما","السعيدي","كفردان","حوش بردة","حوش الرافقة","حزين","مجدلون","شمسطار","طاريا","الحدث","تمنين الفوقا"
    ,"طليا","الطيبه","سرعين","الخضر","شليفا","بوداي","حوش الذهب","دير الاحمر","الكنيسة","تمنين التحتا","النبي شيت","يونين"
    ,"حور تقلا","بريتال","حوش النبي شيت","القاع","البنجكية - القاع","القاع - وادي الخنزير","القاع - بعيون","رأس بعلبك السهل","شعت",
    "حوش تل صفية","الخريبة","جبولة والبجاجة","النبي عثمان","العين","مقراق ومزرعة الفقر","عين بورضاي","سلوقية","جبعا","بتدعي","قرحا",
    "الرام","برقا","بشوات","عيناتا","اليمونة","بيت مشيك","دار الواسعة","جنطا","يحفوفا","معربون","عين البنية","عين الجوزة","طفيل"
    ,"الشعيبة","عمشكي","عرسال","نحلة","حام","نبي سباط","عين ساعة والشادور","بعلبك","قصر نبا","بدنايل","رأس بعلبك و وادي فعرا"
    ,"دير مار مارون","كفردبش","مصرايا","حوش سنيد","راس بعلبك الشرقي","الفاكهة","ايعات","عدوس","مقنة","ريحا","اللبوة","زبّود","نبحا"
    ,"حربتا","القدام","غلاوي","تل صوغا","المعيصرة","مزرعة الضهر","وادي فعرة","عين السوده","تل العلاف","النبي رشاده","رسم الحدث"
  ]

  ,

"الهرمل" : [
    
  "الهرمل","شربين الهرمل","هرمل زغرين","جباب الهرمل"
  ,"رأس بعلبك و وادي فعرا","رأس بعلبك الغربي","حربتا"
  ,"الخرايب","وادي فعرا","حلبتا","وادي العس","المعيصرة","دير مارون","بديتا"
    ]
  
  }

  }

  // elements 1 mof
  window.onload = function() {
    var GovSel = document.getElementById("governorate1");
    var DisSel = document.getElementById("district1");
    var ReaSel = document.getElementById("real_estate_area1");
    for (var x in GovernorateObject) {
      GovSel.options[GovSel.options.length] = new Option(x, x);
    }
    GovSel.onchange = function() {
      //empty Districts - and Real_estate_area- dropdowns
      ReaSel.length = 1;
      DisSel.length = 1;
      //display correct values
      for (var y in GovernorateObject[this.value]) {
        DisSel.options[DisSel.options.length] = new Option(y, y);
      }
    }
    DisSel.onchange = function() {
      //empty Chapters dropdown
      ReaSel.length = 1;
      //display correct values
      var z = GovernorateObject[GovSel.value][this.value];
      for (var i = 0; i < z.length; i++) {
        ReaSel.options[ReaSel.options.length] = new Option(z[i], z[i]);
      }
    }

    // elements 2 ssn
   
    var GovSel2 = document.getElementById("governorate2");
    var DisSel2 = document.getElementById("district2");
    var ReaSel2 = document.getElementById("real_estate_area2");
    for (var x in GovernorateObject) {
      GovSel2.options[GovSel2.options.length] = new Option(x, x);
    }
    GovSel2.onchange = function() {
      //empty Districts - and Real_estate_area- dropdowns
      ReaSel2.length = 1;
      DisSel2.length = 1;
      //display correct values
      for (var y in GovernorateObject[this.value]) {
        DisSel2.options[DisSel2.options.length] = new Option(y, y);
      }
    }
    DisSel2.onchange = function() {
      //empty Chapters dropdown
      ReaSel2.length = 1;
      //display correct values
      var z = GovernorateObject[GovSel2.value][this.value];
      for (var i = 0; i < z.length; i++) {
        ReaSel2.options[ReaSel2.options.length] = new Option(z[i], z[i]);
      }
    }


  }


  //cascading dropdwon ====ends here=====

  function copyAddress(){

    $('#street2').val( $('#street1').val()  ); 
    $('#neighborhood2').val( $('#neighborhood1').val()  ); 
    $('#real_estate_number2').val( $('#real_estate_number1').val()  ); 
    $('#division_number2').val( $('#division_number1').val()  ); 
    $('#building2').val( $('#building1').val()  ); 
    $('#floor2').val( $('#floor1').val()  ); 
    $('#phone2').val( $('#phone1').val()  ); 
    $('#fax2').val( $('#fax1').val()  ); 
    $('#mailbox2').val( $('#mailbox1').val()  ); 
    $('#region2').val( $('#region1').val()  ); 
    $('#changed_date2').val( $('#changed_date1').val()  );
    

    

}




//check marital status (employee edit)

function checkMaritalStatus(id) {
    if($("#" + id).val() == 'أعذب'){
        $("#married").hide();
    }
    else{
      $("#married").show();
    }



}


function checkIfLeftJob(id){
  if($("#"+id).val() != null ) {
    $("#backToJob").show()
  }
  else{
    $("#backToJob").hide()
  }

}

function checkIfRegInSsn(id){
  if($("#"+id).val() == 'كلّا') {
    $(".ssndetails").hide()
  }
  else{
    $(".ssndetails").show()
  }
}

function checkIfOtherCompany(id){
  if($("#"+id).val() == 'كلّا') {
    $(".othercompdetails").hide()
  }
  else{
    $(".othercompdetails").show()
  }
}


function checkIfStudent(id){
  if($("#"+id).val() == 'كلّا') {
    $(".isstudent").hide()
  }
  else{
    $(".isstudent").show()
  }
}


$("#showPassAnchor").on('click' , function(event) {

  event.preventDefault;

  $("#mofPassHided").toggle();

  $("#showMofPass").css('display','flex');
  

});

$("#hidePassAnchor").on('click' , function(event) {

  event.preventDefault;

  $("#showMofPass").toggle();
  
  $("#mofPassHided").toggle();


});





 
